jordan-deitsch/esp32_cam/ESP32_CAM_Test/src/camera/app_httpd.cpp
static esp_err_t pll_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int bypass = parse_get_var(buf, "bypass", 0);
  int mul = parse_get_var(buf, "mul", 0);
  int sys = parse_get_var(buf, "sys", 0);
  int root = parse_get_var(buf, "root", 0);
  int pre = parse_get_var(buf, "pre", 0);
  int seld5 = parse_get_var(buf, "seld5", 0);
  int pclken = parse_get_var(buf, "pclken", 0);
  int pclk = parse_get_var(buf, "pclk", 0);
  free(buf);

  log_i("Set Pll: bypass: %d, mul: %d, sys: %d, root: %d, pre: %d, seld5: %d, pclken: %d, pclk: %d", bypass, mul, sys, root, pre, seld5, pclken, pclk);
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_pll(s, bypass, mul, sys, root, pre, seld5, pclken, pclk);
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t win_handler(httpd_req_t *req) {
  char *buf = NULL;

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }

  int startX = parse_get_var(buf, "sx", 0);
  int startY = parse_get_var(buf, "sy", 0);
  int endX = parse_get_var(buf, "ex", 0);
  int endY = parse_get_var(buf, "ey", 0);
  int offsetX = parse_get_var(buf, "offx", 0);
  int offsetY = parse_get_var(buf, "offy", 0);
  int totalX = parse_get_var(buf, "tx", 0);
  int totalY = parse_get_var(buf, "ty", 0);  // codespell:ignore totaly
  int outputX = parse_get_var(buf, "ox", 0);
  int outputY = parse_get_var(buf, "oy", 0);
  bool scale = parse_get_var(buf, "scale", 0) == 1;
  bool binning = parse_get_var(buf, "binning", 0) == 1;
  free(buf);

  log_i(
    "Set Window: Start: %d %d, End: %d %d, Offset: %d %d, Total: %d %d, Output: %d %d, Scale: %u, Binning: %u", startX, startY, endX, endY, offsetX, offsetY,
    totalX, totalY, outputX, outputY, scale, binning  // codespell:ignore totaly
  );
  sensor_t *s = esp_camera_sensor_get();
  int res = s->set_res_raw(s, startX, startY, endX, endY, offsetX, offsetY, totalX, totalY, outputX, outputY, scale, binning);  // codespell:ignore totaly
  if (res) {
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t index_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
  sensor_t *s = esp_camera_sensor_get();
  if (s != NULL) {
    if (s->id.PID == OV3660_PID) {
      return httpd_resp_send(req, (const char *)index_ov3660_html_gz, index_ov3660_html_gz_len);
    } else if (s->id.PID == OV5640_PID) {
      return httpd_resp_send(req, (const char *)index_ov5640_html_gz, index_ov5640_html_gz_len);
    } else {
      return httpd_resp_send(req, (const char *)index_ov2640_html_gz, index_ov2640_html_gz_len);
    }
  } else {
    log_e("Camera sensor not found");
    return httpd_resp_send_500(req);
  }
}

extern volatile float serverValueArr[8];

static esp_err_t sensor_handler(httpd_req_t *req) {
  char json[2048];
  snprintf(json, sizeof(json),
            "{"
            "\"server_val0\": %f,"
            "\"server_val1\": %f,"
            "\"server_val2\": %f,"
            "\"server_val3\": %f,"
            "\"server_val4\": %f,"
            "\"server_val5\": %f,"
            "\"server_val6\": %f"
            "\"server_val7\": %f"
            "}",
            serverValueArr[0],
            serverValueArr[1],
            serverValueArr[2],
            serverValueArr[3],
            serverValueArr[4],
            serverValueArr[5],
            serverValueArr[6],
            serverValueArr[7]);

    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, json, HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

static esp_err_t status_page_handler(httpd_req_t *req) {
    const char html[] =
        "<!DOCTYPE html>"
        "<html>"
        "<head>"
        "<meta name='viewport' content='width=device-width, initial-scale=1'>"
        "<title>ESP32-CAM Status</title>"
        "<style>"
        "body{font-family:Arial;text-align:center;background:#111;color:#eee;}"
        "img{width:100%;max-width:480px;}"
        "</style>"
        "</head>"
        "<body>"
        "<h2>ESP32-CAM Status</h2>"
        "<p>Total Gravity: <span id='val0'>---</span></p>"
        "<p>Gravity X: <span id='val1'>---</span></p>"
        "<p>Gravity Y: <span id='val2'>---</span></p>"
        "<p>Gravity Z: <span id='val3'>---</span></p>"
        "<p>Moisture: <span id='val4'>---</span></p>"
        "<p>Humidity: <span id='val5'>---</span></p>"
        "<p>Pressure: <span id='val6'>---</span></p>"
        "<p>Temperature: <span id='val7'>---</span></p>"

        "<script>"
        "setInterval(() => {"
        "  fetch('/sensor_json')"
        "    .then(r => r.json())"
        "    .then(d => {"
        "      document.getElementById('val0').innerText = d.server_val0.toFixed(3);"
        "      document.getElementById('val1').innerText = d.server_val1.toFixed(3);"
        "      document.getElementById('val2').innerText = d.server_val2.toFixed(3);"
        "      document.getElementById('val3').innerText = d.server_val3.toFixed(3);"
        "      document.getElementById('val4').innerText = d.server_val4.toFixed(3);"
        "      document.getElementById('val5').innerText = d.server_val5.toFixed(3);"
        "      document.getElementById('val6').innerText = d.server_val6.toFixed(3);"
        "      document.getElementById('val7').innerText = d.server_val7.toFixed(3);"
        "    });"
        "}, 200);"
        "</script>"

        "<button onclick=\"sendCommand()\">Toggle Button</button>"
        "<script>"
        "function sendCommand() {"
        "  fetch('/button_control?cmd=toggle_button')"
        "    .then(response => response.text())"
        "    .then(data => {"
        "      console.log('Response:', data);"
        "    })"
        "    .catch(error => {"
        "      console.error('Error:', error);"
        "      alert('Failed to send command.');"
        "    });"
        "}"
        "</script>"

        "</body>"
        "</html>";

